W7D4/GoalApp/app/models/user.rb

UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-03-27 01:11:10.396817"], ["session_token", "3e9QFUQe8C-fZqg70lpGhA"], ["id", 2]]
---
    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save